enum DaysOfWeek {
  'Пн' = 'Понедельник',
  'Вт' = 'Вторник',
  'Ср' = 'Среда',
  'Чт' = 'Четверг',
  'Пт' = 'Пятница',
  'Сб' = 'Суббота',
  'Вс' = 'Воскресенье',
}

enum DaysOfWeekNumber {
  'Пн' = 1,
  'Вт' = 2,
  'Ср' = 3,
  'Чт' = 4,
  'Пт' = 5,
  'Сб' = 6,
  'Вс' = 7,
}

enum DaysOfWeekReverse {
 'Понедельник' = 'Пн',
  'Вторник' = 'Вт',
  'Среда' = 'Ср',
  'Четверг' = 'Чт',
  'Пятница' = 'Пт',
  'Суббота' = 'Сб',
  'Воскресенье' = 'Вс',
}

enum Week {
  '0' = 'Эта неделя',
  '7' = 'Прошедшая неделя',
  '14' = '2 недели назад'
}

export {DaysOfWeek, DaysOfWeekReverse, Week, DaysOfWeekNumber}